{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "use_bias": true, "name": "conv2d_1", "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "dtype": "float32", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activation": "relu", "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_2", "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "sigmoid"}}], "name": "sequential_1"}}