{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"trainable": true, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_1", "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "kernel_constraint": null, "data_format": "channels_last", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_2", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 128, "bias_constraint": null, "name": "dense_1", "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 1, "bias_constraint": null, "name": "dense_2", "activation": "sigmoid", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}